# Задача 1
# import math
# more_than_five = []
# s = []
# while True:
#     i = int(input('Введите число списка, значение 999 завершает ввод :'))
#     if i == 999:
#         break
#     s.append(i)
# print('Ваш список:', s )
# for i in s:
#     if math.fabs(i) > 5:
#         more_than_five.append(i)
# print('Новый список', more_than_five)

# Задача 2
# s = []
# while True:
#     i = int(input('Введите число списка, значение 999 завершает ввод :'))
#     if i == 999:
#         break
#     s.append(i)
# print('Исходный список', s)
# c = set(s)
# print('Список без дубликатов:', list(c))

#Задача 3
# a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
# b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 12, 13]
# c = []
# for i in a:
#     if i in b:
#         c.append(i)
# print('Список общих элементов:', c)

# Задача 4
# a ={1:2, 2:3, 3:4}
# b= {4:5 , 5:6}
# for i in b:
#     a[i] = b[i]
# print(a)

#Задача 5
# a = input('Введите строку: ')
# b = a[::-1]
# print('Ваша строка: ', a)
# print('Перевёрнутая строка: ', b)
# if a == b:
#     print('Введённая строка - палиндром')
# else:
#     print('Введённая строка - не палиндром')

# Задача 6
# a = input('Введите последовательность чисел через запятую:')
# b = a.split(',')
# b1 = []
# for i in b:
#     b1.append(int(i))
# c = tuple(b1)
# print(a, '\n', b1, '\n', c)

# Задача 7
# n = int(input('Введите число n: '))
# b = n + (n ** 2) + (n ** 3)
# print('n + n^2 + n^3 = ',b)

# Задача 8
# numbers = [386, 462, 47, 418, 907, 344, 236, 375, 823, 566, 597, 978, 328, 615, 953, 345, 399, 162, 758, 219, 918, 237, 412, 566, 826, 248, 866, 950, 626, 949, 687, 217]
# for i in numbers:
#     if i == 237:
#         break
#     if i % 2 == 0:
#         print(i)

# Задача 9
# a = input('Введите целое семизначное число:')
# sum = 0
# for i in a:
#     sum += int(i)
# print(a, '\n' ,'Сумма чисел: ', sum)

# Задача 10
# a = input('Введите строку ')
# b = input('Введите символ ')
# print('Символ ', b,'встречается ', a.count(b), 'раз(а)')

# Задача 11
# a = input('введите значение переменной a: ')
# b = input('введите значение переменной b: ')
# c = a
# a = b
# b = c
# print('a = ',  a,'\n','b = ',b)

# Задача 11
a = input('Введите последовательность чисел через запятую: ')
b = a.split(',')
for i in b:
    if b.count(i) > 1:
        print('Не все числа последовательности уникальны')
        break








